//============================================================
//
//	ゲームマネージャーヘッダー [gameManager.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GAMEMANAGER_H_
#define _GAMEMANAGER_H_

//************************************************************
//	前方宣言
//************************************************************
class CBlock;	// ブロッククラス

//************************************************************
//	定数宣言
//************************************************************
namespace grid
{
	const int WIDTH	 = 10;	// グリッド横幅
	const int HEIGHT = 10;	// グリッド縦幅
}

//************************************************************
//	クラス定義
//************************************************************
// ゲームマネージャークラス
class CGameManager
{
public:
	// コンストラクタ
	CGameManager();

	// デストラクタ
	~CGameManager();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(const float fDeltaTime);	// 更新

	// 静的メンバ関数
	static CGameManager *Create(void);	// 生成
	static void Release(CGameManager *&prGameManager);	// 破棄

private:
	// メンバ変数
	CBlock *m_apGrid[grid::WIDTH][grid::HEIGHT];	// グリッド情報
};

#endif	// _GAMEMANAGER_H_
